%% ========================================================================
% Описание модели
% =========================================================================
clc;
% Количество тел
p.n  = 7;

% Колчиество степеней свободы в каждом шарнире (от 1 до 3)
p.na = [1;1;1;1;1;1;1];

% Матрица инцидентности 
p.S0 = [ 1  0  0  0  0  0  0];
p.S  = [-1  1  0  0  0  0  0   
         0 -1  1  0  0  0  0
         0  0 -1  1  1  0  0
         0  0  0 -1  0  1  0
         0  0  0  0 -1  0  1
         0  0  0  0  0 -1  0
         0  0  0  0  0  0 -1];

     
    
% Шарнирные векторы
p.C  = zeros(3,p.n,p.n);
L1 = 1;L2 = 1;L3 = 0.1;b = 0.1;L4 = 0.2;
% Все векторы нулевые кроме этих:
p.C(:,1,1)  = [0;0; L1];
p.C(:,1,2)  = [0;0;-L1];

p.C(:,2,2)  = [0;0;+L2];
p.C(:,2,3)  = [0;0;-L2];

p.C(:,3,3)  = [0;0; L3];

p.C(:,3,4)  = [-b/2;0;0];
p.C(:,3,5)  = [+b/2;0;0];

p.C(:,4,4)  = [0;0; L4];
p.C(:,4,6)  = [0;0;-L4];
p.C(:,6,6)  = [0;0; L4];

p.C(:,5,5)  = [0;0; L4];
p.C(:,5,7)  = [0;0;-L4];
p.C(:,7,7)  = [0;0; L4];

% Массы тел
p.mass = [3;3;2;0.5;0.5;0.5;0.5];       

% Тензоры инерции тел
p.I    = zeros(3,3,p.n);
p.I(:,:,1) = p.mass(1)*diag([4/3,4/3,0.6*4/2]);     % Iz = 60% of (Ix,Iy)
p.I(:,:,2) = p.mass(2)*diag([4/3,4/3,0.6*4/3]);     % Iz = 60% of (Ix,Iy)
p.I(:,:,3) = p.mass(3)*diag([4/3,4/3,0.6*4/3]);
p.I(:,:,4) = p.mass(4)*diag([4/3,4/3,0.6*4/3]);     % Iz = 60% of (Ix,Iy)
p.I(:,:,5) = p.mass(5)*diag([4/3,4/3,0.6*4/3]);     % Iz = 60% of (Ix,Iy)
p.I(:,:,6) = p.mass(6)*diag([4/3,4/3,0.6*4/3]);     % Iz = 60% of (Ix,Iy)
p.I(:,:,7) = p.mass(7)*diag([4/3,4/3,0.6*4/3]);     % Iz = 60% of (Ix,Iy)

%
% Кинематика
%
p.A  = cell(p.n,1);
p.p  = cell(p.n,1);
p.pw = cell(p.n,1);

% Матрицы поворота вокруг осей 
Ax = @(x) [1 0 0; 0 cos(x) -sin(x); 0 sin(x) cos(x)];
Ay = @(x) [cos(x) 0 sin(x); 0 1 0; - sin(x) 0 cos(x)];
Az = @(x) [cos(x) -sin(x) 0; sin(x) cos(x) 0; 0 0 1];

% Первый шарнир
% 0-1 (1 to 0) joint (spherical)
p.A{1} = @(q) Ax(q(1));

% Второй шарнир
% 1-2 (2 to 1) joint (spherical)
p.A{2} = @(q) Ax(q(1));

% Третий шарнир
% 2-3 (3 to 2) joint (cylindrical)
p.A{3} = @(q) Ax(q(1));

% Четвертый шарнир
% 3-4 (4 to 3) joint (cylindrical)
p.A{4} = @(q) Ay(q);

% Пятый шарнир
% 3-5 (5 to 3) joint (cylindrical)
p.A{5} = @(q) Ay(q);

p.A{6} = @(q) Ay(q);
p.A{7} = @(q) Ay(q);

% Единичные векторы элементарных поворотов в шарнирах
% p-vectors
p.p{1} = @(q) [1;0;0];
% 3-4 cylindrical joint: 3 x 1
p.p{2} = @(q) [1;0;0];
p.p{3} = @(q) [1;0;0];
p.p{4} = @(q) [0;1;0];
p.p{5} = @(q) [0;1;0];
p.p{6} = @(q) [0;1;0];
p.p{7} = @(q) [0;1;0];


% Выражения для относительной скорости, как функции обобщенных координат и
% обобщенных скорсотей
p.Wr{1} = @(q,dq)  p.p{1}(q)*dq;
p.Wr{2} = @(q,dq)  p.p{2}(q)*dq;
p.Wr{3} = @(q,dq)  p.p{3}(q)*dq;
p.Wr{4} = @(q,dq)  p.p{4}(q)*dq;
p.Wr{5} = @(q,dq)  p.p{5}(q)*dq;
p.Wr{6} = @(q,dq)  p.p{6}(q)*dq;
p.Wr{7} = @(q,dq)  p.p{7}(q)*dq;

% Производные

p.pw{1} = @(q,dq) [0;0;0]; 
p.pw{2} = @(q,dq) [0;0;0]; 
p.pw{3} = @(q,dq) [0;0;0]; 
p.pw{4} = @(q,dq) [0;0;0]; 
p.pw{5} = @(q,dq) [0;0;0]; 
p.pw{6} = @(q,dq) [0;0;0]; 
p.pw{7} = @(q,dq) [0;0;0]; 
% ========================================================================
% Preprocessing
% =========================================================================
preproc;
% ========================================================================
% Simulation
% =========================================================================
% Начальные условия
q0 = [1; 0; 0; 0.1; 0; 0.1; 0;   0; 0; 0; 0; 0; 0; 0];
% Интегрирование
[t, q] = ode113(@(t,q) ode_dqdt(t,q,p), [0 5], q0, odeset('RelTol',1e-7));
fprintf('OK\n');

%% ========================================================================
% Пособработка
% =========================================================================
set(0,'defaultLineLineWidth',2);
set(0,'defaultFigureColor','w');
set(0,'defaultAxesFontSize',12);
set(0,'DefaultAxesXGrid','on');
set(0,'DefaultAxesYGrid','on');

figure;
subplot(311);
plot(t, q(:,1:3));legend('\phi_{1}, \phi_{2}, \phi_{3}');xlabel('t, s');
subplot(312);
plot(t, q(:,4:5));legend('\phi_{4}, \phi_{5}');xlabel('t, s');
subplot(313);
plot(t, q(:,6:7));legend('\phi_{6}, \phi_{7}');xlabel('t, s');
set(gca,'FontSize',12); grid on;

%% ========================================================================
% Validation : Checking conservation of the energy
% =========================================================================
figure;
[T, V] = Energy(q,p);
figure;
plot(t, T+V,'-',t, T,'--', t, V,':'); 
legend('Total energy', 'Kinetic energy', 'Potential energy'); 
xlabel('t, s'); ylabel('Energy, J');

%% ========================================================================
% Export data for animation 
% =========================================================================
csvwrite('results.csv',q)
csvwrite('vec_d.csv',p.d)
